; domain
(define (domain satellite)
  (:requirements :typing :fluents :equality)
 (:types satellite direction instrument mode)
 (:predicates 
               (on_board ?i - instrument ?s - satellite)
	       (supports ?i - instrument ?m - mode)
	       (pointing ?s - satellite ?d - direction)
	       (power_avail ?s - satellite)
	       (power_on ?i - instrument)
	       (calibrated ?i - instrument)
	       (have_image ?d - direction ?m - mode)
	       (calibration_target ?i - instrument ?d - direction))
 
 

  (:functions (data_capacity ?s - satellite)
	      (data ?d - direction ?m - mode)
		(slew_time ?a ?b - direction)
		(data-stored)
		(fuel ?s - satellite)
		(fuel-used)
  )

  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev)
                   (not (= ?d_new ?d_prev))
		(>= (fuel ?s) (slew_time ?d_new ?d_prev))
              )
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))
		(decrease (fuel ?s) (slew_time ?d_new ?d_prev))
		(increase (fuel-used) (slew_time ?d_new ?d_prev))
           )
  )

 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
 
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s)
                 )
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))
           )
          
  )

 
  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
 
   :precondition (and (on_board ?i ?s)
                      (power_on ?i) 
                  )
   :effect (and (not (power_on ?i))
                (power_avail ?s)
           )
  )

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i)
                  )
   :effect (calibrated ?i)
  )
 

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d)
                      (power_on ?i)
			  (>= (data_capacity ?s) (data ?d ?m))
               )
   :effect (and (decrease (data_capacity ?s) (data ?d ?m)) (have_image ?d ?m)
		(increase (data-stored) (data ?d ?m)))
  )
)

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	instrument2 - instrument
	satellite1 - satellite
	instrument3 - instrument
	instrument4 - instrument
	satellite2 - satellite
	instrument5 - instrument
	infrared2 - mode
	thermograph0 - mode
	thermograph1 - mode
	Star2 - direction
	GroundStation1 - direction
	Star0 - direction
	Star3 - direction
	Star4 - direction
	Star5 - direction
	Phenomenon6 - direction
	Phenomenon7 - direction
)
(:init
	(supports instrument0 infrared2)
	(calibration_target instrument0 GroundStation1)
	(supports instrument1 thermograph1)
	(supports instrument1 thermograph0)
	(calibration_target instrument1 GroundStation1)
	(supports instrument2 infrared2)
	(calibration_target instrument2 GroundStation1)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(on_board instrument2 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star2)
	(= (data_capacity satellite0) 1000)
	(= (fuel satellite0) 140)
	(supports instrument3 thermograph0)
	(supports instrument3 thermograph1)
	(calibration_target instrument3 Star0)
	(supports instrument4 thermograph0)
	(calibration_target instrument4 Star0)
	(on_board instrument3 satellite1)
	(on_board instrument4 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Star2)
	(= (data_capacity satellite1) 1000)
	(= (fuel satellite1) 172)
	(supports instrument5 thermograph1)
	(supports instrument5 thermograph0)
	(calibration_target instrument5 Star3)
	(on_board instrument5 satellite2)
	(power_avail satellite2)
	(pointing satellite2 Star0)
	(= (data_capacity satellite2) 1000)
	(= (fuel satellite2) 134)
	(= (data Star4 infrared2) 48)
	(= (data Star5 infrared2) 167)
	(= (data Phenomenon6 infrared2) 140)
	(= (data Phenomenon7 infrared2) 223)
	(= (data Star4 thermograph0) 12)
	(= (data Star5 thermograph0) 217)
	(= (data Phenomenon6 thermograph0) 54)
	(= (data Phenomenon7 thermograph0) 149)
	(= (data Star4 thermograph1) 161)
	(= (data Star5 thermograph1) 263)
	(= (data Phenomenon6 thermograph1) 109)
	(= (data Phenomenon7 thermograph1) 166)
	(= (slew_time Star2 Star0) 39.52)
	(= (slew_time Star0 Star2) 39.52)
	(= (slew_time Star2 GroundStation1) 86.36)
	(= (slew_time GroundStation1 Star2) 86.36)
	(= (slew_time GroundStation1 Star0) 13.2)
	(= (slew_time Star0 GroundStation1) 13.2)
	(= (slew_time Star3 Star0) 22.5)
	(= (slew_time Star0 Star3) 22.5)
	(= (slew_time Star3 GroundStation1) 14.35)
	(= (slew_time GroundStation1 Star3) 14.35)
	(= (slew_time Star3 Star2) 29.03)
	(= (slew_time Star2 Star3) 29.03)
	(= (slew_time Star4 Star0) 19.54)
	(= (slew_time Star0 Star4) 19.54)
	(= (slew_time Star4 GroundStation1) 11.26)
	(= (slew_time GroundStation1 Star4) 11.26)
	(= (slew_time Star4 Star2) 20.63)
	(= (slew_time Star2 Star4) 20.63)
	(= (slew_time Star4 Star3) 14.3)
	(= (slew_time Star3 Star4) 14.3)
	(= (slew_time Star5 Star0) 10.11)
	(= (slew_time Star0 Star5) 10.11)
	(= (slew_time Star5 GroundStation1) 5.551)
	(= (slew_time GroundStation1 Star5) 5.551)
	(= (slew_time Star5 Star2) 64.05)
	(= (slew_time Star2 Star5) 64.05)
	(= (slew_time Star5 Star3) 9.184)
	(= (slew_time Star3 Star5) 9.184)
	(= (slew_time Star5 Star4) 36.94)
	(= (slew_time Star4 Star5) 36.94)
	(= (slew_time Phenomenon6 Star0) 60.2)
	(= (slew_time Star0 Phenomenon6) 60.2)
	(= (slew_time Phenomenon6 GroundStation1) 44.58)
	(= (slew_time GroundStation1 Phenomenon6) 44.58)
	(= (slew_time Phenomenon6 Star2) 27.11)
	(= (slew_time Star2 Phenomenon6) 27.11)
	(= (slew_time Phenomenon6 Star3) 57.09)
	(= (slew_time Star3 Phenomenon6) 57.09)
	(= (slew_time Phenomenon6 Star4) 73.51)
	(= (slew_time Star4 Phenomenon6) 73.51)
	(= (slew_time Phenomenon6 Star5) 20.41)
	(= (slew_time Star5 Phenomenon6) 20.41)
	(= (slew_time Phenomenon7 Star0) 6.873)
	(= (slew_time Star0 Phenomenon7) 6.873)
	(= (slew_time Phenomenon7 GroundStation1) 53.51)
	(= (slew_time GroundStation1 Phenomenon7) 53.51)
	(= (slew_time Phenomenon7 Star2) 14.45)
	(= (slew_time Star2 Phenomenon7) 14.45)
	(= (slew_time Phenomenon7 Star3) 66.42)
	(= (slew_time Star3 Phenomenon7) 66.42)
	(= (slew_time Phenomenon7 Star4) 23.55)
	(= (slew_time Star4 Phenomenon7) 23.55)
	(= (slew_time Phenomenon7 Star5) 16.79)
	(= (slew_time Star5 Phenomenon7) 16.79)
	(= (slew_time Phenomenon7 Phenomenon6) 9.054)
	(= (slew_time Phenomenon6 Phenomenon7) 9.054)
	(= (data-stored) 0)
	(= (fuel-used) 0)
)
(:goal (and
	(pointing satellite2 Star3)
	(have_image Star4 thermograph0)
	(have_image Phenomenon6 thermograph0)
	(have_image Phenomenon7 infrared2)
))
(:metric minimize (fuel-used))

)

; plan
1. (turn_to satellite0 groundstation1 star2)
   deleted: (pointing satellite0 star2)
   added: (pointing satellite0 groundstation1)
   changed: (fuel satellite0) from 140 to 53.64, (fuel-used) from 0 to 86.36
   goals met: 0 of 4
2. (turn_to satellite2 star5 star0)
   deleted: (pointing satellite2 star0)
   added: (pointing satellite2 star5)
   changed: (fuel satellite2) from 134 to 123.89, (fuel-used) from 86.36 to 96.47
   goals met: 0 of 4
3. (turn_to satellite0 star0 groundstation1)
   deleted: (pointing satellite0 groundstation1)
   added: (pointing satellite0 star0)
   changed: (fuel satellite0) from 53.64 to 40.44, (fuel-used) from 96.47 to 109.67
   goals met: 0 of 4
4. (turn_to satellite2 star4 star5)
   deleted: (pointing satellite2 star5)
   added: (pointing satellite2 star4)
   changed: (fuel satellite2) from 123.89 to 86.95, (fuel-used) from 109.67 to 146.61
   goals met: 0 of 4
5. (turn_to satellite2 star3 star4)
   deleted: (pointing satellite2 star4)
   added: (pointing satellite2 star3)
   changed: (fuel satellite2) from 86.95 to 72.65, (fuel-used) from 146.61 to 160.91
   goals met: 1 of 4
6. (switch_on instrument5 satellite2)
   deleted: (power_avail satellite2)
   added: (power_on instrument5)
   goals met: 1 of 4
7. (switch_on instrument2 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument2)
   goals met: 1 of 4
8. (calibrate satellite2 instrument5 star3)
   added: (calibrated instrument5)
   goals met: 1 of 4
9. (turn_to satellite2 star4 star3)
   deleted: (pointing satellite2 star3)
   added: (pointing satellite2 star4)
   changed: (fuel satellite2) from 72.65 to 58.35, (fuel-used) from 160.91 to 175.21
   goals met: 0 of 4
10. (take_image satellite2 star4 instrument5 thermograph0)
   added: (have_image star4 thermograph0)
   changed: (data_capacity satellite2) from 1000 to 988, (data-stored) from 0 to 12
   goals met: 1 of 4
11. (turn_to satellite2 star3 star4)
   deleted: (pointing satellite2 star4)
   added: (pointing satellite2 star3)
   changed: (fuel satellite2) from 58.35 to 44.05, (fuel-used) from 175.21 to 189.51
   goals met: 2 of 4
12. (turn_to satellite0 groundstation1 star0)
   deleted: (pointing satellite0 star0)
   added: (pointing satellite0 groundstation1)
   changed: (fuel satellite0) from 40.44 to 27.24, (fuel-used) from 189.51 to 202.71
   goals met: 2 of 4
13. (turn_to satellite1 star0 star2)
   deleted: (pointing satellite1 star2)
   added: (pointing satellite1 star0)
   changed: (fuel satellite1) from 172 to 132.48, (fuel-used) from 202.71 to 242.23
   goals met: 2 of 4
14. (turn_to satellite1 phenomenon7 star0)
   deleted: (pointing satellite1 star0)
   added: (pointing satellite1 phenomenon7)
   changed: (fuel satellite1) from 132.48 to 125.607, (fuel-used) from 242.23 to 249.103
   goals met: 2 of 4
15. (calibrate satellite0 instrument2 groundstation1)
   added: (calibrated instrument2)
   goals met: 2 of 4
16. (turn_to satellite0 star0 groundstation1)
   deleted: (pointing satellite0 groundstation1)
   added: (pointing satellite0 star0)
   changed: (fuel satellite0) from 27.24 to 14.04, (fuel-used) from 249.103 to 262.303
   goals met: 2 of 4
17. (turn_to satellite0 phenomenon7 star0)
   deleted: (pointing satellite0 star0)
   added: (pointing satellite0 phenomenon7)
   changed: (fuel satellite0) from 14.04 to 7.167, (fuel-used) from 262.303 to 269.176
   goals met: 2 of 4
18. (switch_on instrument4 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument4)
   goals met: 2 of 4
19. (turn_to satellite1 star0 phenomenon7)
   deleted: (pointing satellite1 phenomenon7)
   added: (pointing satellite1 star0)
   changed: (fuel satellite1) from 125.607 to 118.734, (fuel-used) from 269.176 to 276.049
   goals met: 2 of 4
20. (calibrate satellite1 instrument4 star0)
   added: (calibrated instrument4)
   goals met: 2 of 4
21. (turn_to satellite1 phenomenon6 star0)
   deleted: (pointing satellite1 star0)
   added: (pointing satellite1 phenomenon6)
   changed: (fuel satellite1) from 118.734 to 58.534, (fuel-used) from 276.049 to 336.249
   goals met: 2 of 4
22. (take_image satellite1 phenomenon6 instrument4 thermograph0)
   added: (have_image phenomenon6 thermograph0)
   changed: (data_capacity satellite1) from 1000 to 946, (data-stored) from 12 to 66
   goals met: 3 of 4
23. (take_image satellite0 phenomenon7 instrument2 infrared2)
   added: (have_image phenomenon7 infrared2)
   changed: (data_capacity satellite0) from 1000 to 777, (data-stored) from 66 to 289
   goals met: 4 of 4
